;汉化：aotix

[LegionChassis X2SparkArmorTemplate_DLC_3]
FriendlyName="军团底盘"
FriendlyNamePlural="军团底盘"
BriefSummary="一种重型SPARK底盘，提供出色的保护和生存能力，但代价是普通底盘的机动性。该底盘赋予SPARK单位新的战斗能力，使其能够以强大的火力支持我们的小队。"
TacticalText="<Bullet/> 军团底盘提供出色的保护和生存能力。\n<Bullet/> 两种版本的强力射击可以摧毁大范围目标，并受益于重型武器。\n<Bullet/> 枪盾使SPARK能够抵消受到的伤害并进行反击。"

[LegionChassisMk2 X2SparkArmorTemplate_DLC_3]
FriendlyNamePlural="军团底盘Mk II"
BriefSummary="一种重型SPARK底盘，提供出色的保护和生存能力，但代价是普通底盘的机动性。该底盘赋予SPARK单位新的战斗能力，使其能够以强大的火力支持我们的小队。"
TacticalText="<Bullet/> 新的军团底盘相比前作提供了更高的保护和生存能力。\n<Bullet/> 枪盾现在可以吸收更多的伤害才会破裂。\n<Bullet/> 新的智能核心提供额外的免费射击机会。"

[TitanCore X2SparkArmorTemplate_DLC_3]
FriendlyName="能量核心"
FriendlyNamePlural="能量核心"
BriefSummary="能量核心是泰坦底盘激活其核心能力所必需的。"
